{

	"btprevious" : "Anterior",
	"btnext" : "Próximo",

	"PiL1" : "JAX-RS: Java™ API for RESTful",
	"PiL2" : "Web Services",
	"PiL3" : "Versão 1.0",
	"PiL4" : "8 de Setembro de 2008",
	"PiL5" : "Editores:",
	"PiL6" : "Marc Hadley",
	"PiL7" : "Paul Sandoz",
	"PiL8" : "Comentários para: users@jsr311.dev.java.net",
	"PiL9" : "Sun Microsystems, Inc.",
	"PiL10" : "4150 Network Circle, Santa Clara, CA 95054 USA.",
	"PiL11" : "180, Avenue de L’Europe, 38330 Montbonnot Saint Martin, France",

	"PiiiL1" : "Specification: JSR-000311 - Java™ API for RESTful Web Services (“Specification”)",
	"PiiiL2" : "Version: 1.0",
	"PiiiL3" : "Status: Final Release",
	"PiiiL4" : "Release: September 8, 2008",
	"PiiiL5" : "Copyright 2007 Sun Microsystems, Inc.",
	"PiiiL6" : "4150 Network Circle, Santa Clara, California 95054, U.S.A",
	"PiiiL7" : "180, Avenue de L’Europe, 38330 Montbonnot Saint Martin, France",
	"PiiiL8" : "All rights reserved.",
	"PiiiL9" : "LIMITED LICENSE GRANTS",
	"PiiiL10" : "License for Evaluation Purposes. Sun hereby grants you a fully-paid, non-exclusive, non-transferable, worldwide, limited license (without the right to sublicense), under Sun’s applicable intellectual property rights to view, download, use and reproduce the Specification only for the purpose of internal evaluation. This includes (i) developing applications intended to run on an implementation of the Specification, provided that such applications do not themselves implement any portion(s) of the Specification, and (ii) discussing the Specification with any third party; and (iii) excerpting brief portions of the Specification in oral or written communications which discuss the Specification provided that such excerpts do not in the aggregate constitute a significant portion of the Specification.",
	"PiiiL11" : "License for the Distribution of Compliant Implementations. Sun also grants you a perpetual, non-exclusive, non-transferable, worldwide, fully paid-up, royalty free, limited license (without the right to sublicense) under any applicable copyrights or, subject to the provisions of subsection 4 below, patent rights it may have covering the Specification to create and/or distribute an Independent Implementation of the Specification that: (a) fully implements the Specification including all its required interfaces and functionality; (b) does not modify, subset, superset or otherwise extend the Licensor Name Space, or include any public or protected packages, classes, Java interfaces, fields or methods within the Licensor Name Space other than those required/authorized by the Specification or Specifications being implemented; and (c) passes the Technology Compatibility Kit (including satisfying the requirements of the applicable TCK Users Guide) for such Specification (“Compliant Implementation”). In addition, the foregoing license is expressly conditioned on your not acting outside its scope. No license is granted hereunder for any other purpose (including, for example, modifying the Specification, other than to the extent of your fair use rights, or distributing the Specification to third parties). Also, no right, title, or interest in or to any trademarks, service marks, or trade names of Sun or Sun’s licensors is granted hereunder. Java, and Java-related logos, marks and names are trademarks or registered trademarks of Sun Microsystems, Inc. in the U.S. and other countries.",
	"PiiiL12" : "Pass-through Conditions. You need not include limitations (a)-(c) from the previous paragraph or any other particular “pass through” requirements in any license You grant concerning the use of your Independent Implementation or products derived from it. However, except with respect to Independent Implementations (and products derived from them) that satisfy limitations (a)-(c) from the previous paragraph, You may neither: (a) grant or otherwise pass through to your licensees any licenses under Sun’s applicable intellectual property rights; nor (b) authorize your licensees to make any claims concerning their implementation’s compliance with the Specification in question.",
	"PiiiL13" : "Reciprocity Concerning Patent Licenses.",
	"PiiiL14" : "With respect to any patent claims covered by the license granted under subparagraph 2 above that would be infringed by all technically feasible implementations of the Specification, such license is conditioned upon your offering on fair, reasonable and non-discriminatory terms, to any party seeking it from You, a perpetual, non-exclusive, non-transferable, worldwide license under Your patent rights which are or would be infringed by all technically feasible implementations of the Specification to develop, distribute and use a Compliant Implementation.",
	"PiiiL15" : "With respect to any patent claims owned by Sun and covered by the license granted under subparagraph 2, whether or not their infringement can be avoided in a technically feasible manner when implementing the Specification, such license shall terminate with respect to such claims if You initiate a claim against Sun that it has, in the course of performing its responsibilities as the Specification Lead, induced any other entity to infringe Your patent rights."

}
