{

	"btprevious" : "Anterior",
	"btnext" : "Próximo",

	"PiL1" : "JAX-RS: Java™ API para RESTful",
	"PiL2" : "Web Services",
	"PiL3" : "Versão 1.0",
	"PiL4" : "8 de Setembro de 2008",
	"PiL5" : "Editores:",
	"PiL6" : "Marc Hadley",
	"PiL7" : "Paul Sandoz",
	"PiL8" : "Comentários para: users@jsr311.dev.java.net",
	"PiL9" : "Sun Microsystems, Inc.",
	"PiL10" : "4150 Network Circle, Santa Clara, CA 95054 USA.",
	"PiL11" : "180, Avenue de L’Europe, 38330 Montbonnot Saint Martin, France",

	"PiiiL1" : "Especificação: JSR-000311 - Java™ API for RESTful Web Services (“Specification”)",
	"PiiiL2" : "Versão: 1.0",
	"PiiiL3" : "Status: Versão Final",
	"PiiiL4" : "Release: 8 de Setembro de 2008",
	"PiiiL5" : "Copyright 2007 Sun Microsystems, Inc.",
	"PiiiL6" : "4150 Network Circle, Santa Clara, California 95054, U.S.A",
	"PiiiL7" : "180, Avenue de L’Europe, 38330 Montbonnot Saint Martin, France",
	"PiiiL8" : "Todos os direitos reservados.",
	"PiiiL9" : "CONCESSÕES DE LICENÇA LIMITADA",
	"PiiiL10" : "License for Evaluation Purposes. Sun hereby grants you a fully-paid, non-exclusive, non-transferable, worldwide, limited license (without the right to sublicense), under Sun’s applicable intellectual property rights to view, download, use and reproduce the Specification only for the purpose of internal evaluation. This includes (i) developing applications intended to run on an implementation of the Specification, provided that such applications do not themselves implement any portion(s) of the Specification, and (ii) discussing the Specification with any third party; and (iii) excerpting brief portions of the Specification in oral or written communications which discuss the Specification provided that such excerpts do not in the aggregate constitute a significant portion of the Specification.",
	"PiiiL11" : "License for the Distribution of Compliant Implementations. Sun also grants you a perpetual, non-exclusive, non-transferable, worldwide, fully paid-up, royalty free, limited license (without the right to sublicense) under any applicable copyrights or, subject to the provisions of subsection 4 below, patent rights it may have covering the Specification to create and/or distribute an Independent Implementation of the Specification that: (a) fully implements the Specification including all its required interfaces and functionality; (b) does not modify, subset, superset or otherwise extend the Licensor Name Space, or include any public or protected packages, classes, Java interfaces, fields or methods within the Licensor Name Space other than those required/authorized by the Specification or Specifications being implemented; and (c) passes the Technology Compatibility Kit (including satisfying the requirements of the applicable TCK Users Guide) for such Specification (“Compliant Implementation”). In addition, the foregoing license is expressly conditioned on your not acting outside its scope. No license is granted hereunder for any other purpose (including, for example, modifying the Specification, other than to the extent of your fair use rights, or distributing the Specification to third parties). Also, no right, title, or interest in or to any trademarks, service marks, or trade names of Sun or Sun’s licensors is granted hereunder. Java, and Java-related logos, marks and names are trademarks or registered trademarks of Sun Microsystems, Inc. in the U.S. and other countries.",
	"PiiiL12" : "Pass-through Conditions. You need not include limitations (a)-(c) from the previous paragraph or any other particular “pass through” requirements in any license You grant concerning the use of your Independent Implementation or products derived from it. However, except with respect to Independent Implementations (and products derived from them) that satisfy limitations (a)-(c) from the previous paragraph, You may neither: (a) grant or otherwise pass through to your licensees any licenses under Sun’s applicable intellectual property rights; nor (b) authorize your licensees to make any claims concerning their implementation’s compliance with the Specification in question.",
	"PiiiL13" : "Reciprocity Concerning Patent Licenses.",
	"PiiiL14" : "With respect to any patent claims covered by the license granted under subparagraph 2 above that would be infringed by all technically feasible implementations of the Specification, such license is conditioned upon your offering on fair, reasonable and non-discriminatory terms, to any party seeking it from You, a perpetual, non-exclusive, non-transferable, worldwide license under Your patent rights which are or would be infringed by all technically feasible implementations of the Specification to develop, distribute and use a Compliant Implementation.",
	"PiiiL15" : "With respect to any patent claims owned by Sun and covered by the license granted under subparagraph 2, whether or not their infringement can be avoided in a technically feasible manner when implementing the Specification, such license shall terminate with respect to such claims if You initiate a claim against Sun that it has, in the course of performing its responsibilities as the Specification Lead, induced any other entity to infringe Your patent rights.",
	"PiiiL16" : "Also with respect to any patent claims owned by Sun and covered by the license granted under subparagraph 2 above, where the infringement of such claims can be avoided in a technically feasible manner when implementing the Specification such license, with respect to such claims, shall terminate if You initiate a claim against Sun that its making, having made, using, offering to sell, selling or importing a Compliant Implementation infringes Your patent rights.",
	"PiiiL17" : "Definitions. For the purposes of this Agreement: “Independent Implementation” shall mean an implementation of the Specification that neither derives from any of Sun’s source code or binary code materials nor, except with an appropriate and separate license from Sun, includes any of Sun’s source code or binary code materials; “Licensor Name Space” shall mean the public class or interface declarations whose names begin with “java”, “javax”, “com.sun” or their equivalents in any subsequent naming convention adopted by Sun through the Java Community Process, or any recognized successors or replacements thereof; and “Technology Compatibility Kit” or “TCK” shall mean the test suite and accompanying TCK User’s Guide provided by Sun which corresponds to the Specification and that was available either (i) from Sun’s 120 days before the first release of Your Independent Implementation that allows its use for commercial purposes, or (ii) more recently than 120 days from such release but against which You elect to test Your implementation of the Specification.",

	"PivL1" : "This Agreement will terminate immediately without notice from Sun if you breach the Agreement or act outside the scope of the licenses granted above.",
	"PivL2" : "TRADEMARKS",
	"PivL3" : "No right, title, or interest in or to any trademarks, service marks, or trade names of Sun or Sun’s licensors is granted hereunder. Sun, Sun Microsystems, the Sun logo, Java, are trademarks or registered trademarks of Sun Microsystems, Inc. in the U.S. and other countries.",
	"PivL4" : "DISCLAIMER OF WARRANTIES",
	"PivL5" : "THE SPECIFICATION IS PROVIDED “AS IS”. SUN MAKES NO REPRESENTATIONS OR WARRANTIES, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT (INCLUDING AS A CONSEQUENCE OF ANY PRACTICE OR IMPLEMENTATION OF THE SPECIFICATION), OR THAT THE CONTENTS OF THE SPECIFICATION ARE SUITABLE FOR ANY PURPOSE. This document does not represent any commitment to release or implement any portion of the Specification in any product. In addition, the Specification could include technical inaccuracies or typographical errors.",
	"PivL6" : "LIMITATION OF LIABILITY",
	"PivL7" : "TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT WILL SUN OR ITS LICENSORS BE LIABLE FOR ANY DAMAGES, INCLUDING WITHOUT LIMITATION, LOST REVENUE, PROFITS OR DATA, OR FOR SPECIAL, INDIRECT, CONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF OR RELATED IN ANY WAY TO YOUR HAVING, IMPELEMENTING OR OTHERWISE USING USING THE SPECIFICATION, EVEN IF SUN AND/OR ITS LICENSORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.",
	"PivL8" : "You will indemnify, hold harmless, and defend Sun and its licensors from any claims arising or resulting from: (i) your use of the Specification; (ii) the use or distribution of your Java application, applet and/or implementation; and/or (iii) any claims that later versions or releases of any Specification furnished to you are incompatible with the Specification provided to you under this license.",
	"PivL9" : "RESTRICTED RIGHTS LEGEND",
	"PivL10" : "U.S. Government: If this Specification is being acquired by or on behalf of the U.S. Government or by a U.S. Government prime contractor or subcontractor (at any tier), then the Government’s rights in the Software and accompanying documentation shall be only as set forth in this license; this is in accordance with 48 C.F.R. 227.7201 through 227.7202-4 (for Department of Defense (DoD) acquisitions) and with 48 C.F.R. 2.101 and 12.212 (for non-DoD acquisitions).",
	"PivL11" : "INFORME",
	"PivL12" : "If you provide Sun with any comments or suggestions concerning the Specification (“Feedback”), you hereby: (i) agree that such Feedback is provided on a non-proprietary and non-confidential basis, and (ii) grant Sun a perpetual, non-exclusive, worldwide, fully paid-up, irrevocable license, with the right to sublicense through multiple levels of sublicensees, to incorporate, disclose, and use without limitation the Feedback for any purpose.",
	"PivL13" : "TERMOS GERAIS",
	"PivL14" : "Any action related to this Agreement will be governed by California law and controlling U.S. federal law. The U.N. Convention for the International Sale of Goods and the choice of law rules of any jurisdiction will not apply.",
	"PivL15" : "The Specification is subject to U.S. export control laws and may be subject to export or import regulations in other countries. Licensee agrees to comply strictly with all such laws and regulations and acknowledges that it has the responsibility to obtain such licenses to export, re-export or import as may be required after delivery to Licensee.",
	"PivL16" : "This Agreement is the parties’ entire agreement relating to its subject matter. It supersedes all prior or contemporaneous oral or written communications, proposals, conditions, representations and warranties and prevails over any conflicting or additional terms of any quote, order, acknowledgment, or other communication between the parties relating to its subject matter during the term of this Agreement. No modification to this Agreement will be binding, unless in writing and signed by an authorized representative of each party.",
	"PivL17" : "Rev. April, 2006",

	"PviiL1" : "Introdução",
	"PviiL2" : "Status",
	"PviiL3" : "Goals",
	"PviiL4" : "Non-Goals",
	"PviiL5" : "Convenções",
	"PviiL6" : "Terminolodia",
	"PviiL7" : "Expert Group Members",
	"PviiL8" : "Acknowledgements",
	"PviiL9" : "Aplicações",
	"PviiL10" : "Configuração",
	"PviiL11" : "Validação",
	"PviiL12" : "Publicação",
	"PviiL13" : "Java SE",
	"PviiL14" : "Servlet",
	"PviiL15" : "Outro Container",
	"PviiL16" : "Resources",
	"PviiL17" : "Resource Classes",
	"PviiL18" : "Ciclo de vida e Ambiente",
	"PviiL19" : "Construtores",
	"PviiL20" : "Campos e Propriedades de Bean",
	"PviiL21" : "Resource Methods",
	"PviiL22" : "Visibilidade",
	"PviiL23" : "Parametros",
	"PviiL24" : "Tipo de Retorno",
	"PviiL25" : "Exceções",
	"PviiL26" : "HEAD e OPTIONS",
	"PviiL27" : "URI Templates",
	"PviiL28" : "Sub Resources",
	"PviiL29" : "Declaring Media Type Capabilities",
	"PviiL30" : "Annotation Inheritance",
	"PviiL31" : "Matching Requests to Resource Methods",
	"PviiL32" : "Request Preprocessing",
	"PviiL33" : "Request Matching",
	"PviiL34" : "Converting URI Templates to Regular Expressions",
	"PviiL35" : "Determining the MediaType of Responses",
	"PviiL36" : "Providers",
	"PviiL37" : "Ciclo de vida e Ambiente",
	"PviiL38" : "Construtores",
	"PviiL39" : "Entity Providers",
	"PviiL40" : "Message Body Reader",
	"PviiL41" : "Message Body Writer",
	"PviiL42" : "Declaring Media Type Capabilities",
	"PviiL43" : "Standard Entity Providers",
	"PviiL44" : "Transfer Encoding",
	"PviiL45" : "Content Encoding",
	"PviiL46" : "Context Providers",
	"PviiL47" : "Declaring Media Type Capabilities",
	"PviiL48" : "Exception Mapping Providers",
	"PviiL49" : "Context",
	"PviiL50" : "Concurrency",
	"PviiL51" : "Tipos de Contexto",
	"PviiL52" : "URIs e URI Templates",
	"PviiL53" : "Headers",
	"PviiL54" : "Content Negotiation and Preconditions",
	"PviiL55" : "Security Context",
	"PviiL56" : "Providers",
	"PviiL57" : "Environment",
	"PviiL58" : "Servlet Container",
	"PviiL59" : "Java EE Container (Non-normative)",
	"PviiL60" : "Outro",
	"PviiL61" : "Runtime Delegate",
	"PviiL62" : "Configuração",
	"PviiL63" : "Anotações do Sumário",
	"PviiL64" : "HTTP Header Support",
	"PviiL65" : "Change Log",
	"PviiL66" : "Changes Since Proposed Final Draft",
	"PviiL67" : "Changes Since Public Review Draft",
	"PviiL68" : "Bibliografia",

	"P1L1" : "Capítulo 1",
	"P1L2" : "Introdução",
	"P1L3" : "This specification defines a set of Java APIs for the development of Web services built according to the Representational State Transfer[1] (REST) architectural style. Readers are assumed to be familiar with REST; for more information about the REST architectural style and RESTful Web services, see:",
	"P1L4" : "Architectural Styles and the Design of Network-based Software Architectures[1]",
	"P1L5" : "The REST Wiki[2]",
	"P1L6" : "Representational State Transfer on Wikipedia[3]",
	"P1L7" : "1.1 Status",
	"P1L8" : "This is an editors draft; this specification is not yet complete. A list of open issues can be found at: https://jsr311.dev.java.net/servlets/ProjectIssues",
	"P1L9" : "The latest Javadocs can be found online at: https://jsr311.dev.java.net/nonav/javadoc/index.html",
	"P1L10" : "The reference implementation can be obtained from: https://jersey.dev.java.net/",
	"P1L11" : "The expert group seeks feedback from the community on any aspect of this specification, please send comments to: users@jsr311.dev.java.net",
	"P1L18" : "1.2 Goals",
	"P1L19" : "The following are the goals of the API:",
	"P1L20" : "POJO-based The API will provide a set of annotations and associated classes/interfaces that may be used with POJOs in order to expose them as Web resources. The specification will define object lifecycle and scope.",
	"P1L21" : "HTTP-centric The specification will assume HTTP[4] is the underlying network protocol and will provide a clear mapping between HTTP and URI[5] elements and the corresponding API classes and annotations. The API will provide high level support for common HTTP usage patterns and will be sufficiently flexible to support a variety of HTTP applications including WebDAV[6] and the Atom Publishing Protocol[7].",
	"P1L22" : "Format independence The API will be applicable to a wide variety of HTTP entity body content types. It will provide the necessary pluggability to allow additional types to be added by an application in a standard manner",
	"P1L23" : "Container independence Artifacts using the API will be deployable in a variety of Web-tier containers. The specification will define how artifacts are deployed in a Servlet[8] container and as a JAX-WS[9] Provider.",
	"P1L24" : "Inclusion in Java EE The specification will define the environment for a Web resource class hosted in a Java EE container and will specify how to use Java EE features and components within a Web resource class.",
	"P1L25" : "1.3 Non-Goals",
	"P1L26" : "The following are non-goals:",
	"P1L27" : "Support for Java versions prior to J2SE 5.0 The API will make extensive use of annotations and will require J2SE 5.0 or later.",
	"P1L28" : "Description, registration and discovery The specification will neither define nor require any service description, registration or discovery capability.",
	"P1L29" : "Client APIs The specification will not define client-side APIs. Other specifications are expected to provide such functionality.",
	"P1L30" : "HTTP Stack The specification will not define a new HTTP stack. HTTP protocol support is provided by a container that hosts artifacts developed using the API.",
	"P1L31" : "Data model/format classes The API will not define classes that support manipulation of entity body content, rather it will provide pluggability to allow such classes to be used by artifacts developed using the API.",
	"P1L32" : "1.4 Conventions",
	"P1L33" : "The keywords ‘MUST’, ‘MUST NOT’, ‘REQUIRED’, ‘SHALL’, ‘SHALL NOT’, ‘SHOULD’, ‘SHOULD NOT’, ‘RECOMMENDED’, ‘MAY’, and ‘OPTIONAL’ in this document are to be interpreted as described in RFC 2119[10].",
	"P1L34" : "Java code and sample data fragments are formatted as shown in figure 1.1:",
	"P1L35" : "Figure 1.1: Example Java Code",
	"P1L36" : "URIs of the general form ‘http://example.org/...’ and ‘http://example.com/...’ represent application or context-dependent URIs.",
	"P1L37" : "All parts of this specification are normative, with the exception of examples, notes and sections explicitly marked as ‘Non-Normative’. Non-normative notes are formatted as shown below",
	"P1L38" : "Nota: Esta é uma nota.",
	"P1L39" : "1.5 Terminologia",
	"P1L40" : "Resource class A Java class that uses JAX-RS annotations to implement a corresponding Web resource, see chapter 3.",
	"P1L41" : "Root resource class A resource class annotated with @Path. Root resource classes provide the roots of the resource class tree and provide access to sub-resources, see chapter 3.",
	"P1L41" : "Request method designator A runtime annotation annotated with @HttpMethod. Used to identify the HTTP request method to be handled by a resource method",
	"P1L42" : "Resource method A method of a resource class annotated with a request method designator that is used to handle requests on the corresponding resource, see section 3.3.",
	"P1L43" : "Sub-resource locator A method of a resource class that is used to locate sub-resources of the corresponding resource, see section 3.4.1. ",
	"P1L44" : "Sub-resource method A method of a resource class that is used to handle requests on a sub-resource of the corresponding resource, see section 3.4.1. ",
	"P1L45" : "Provider An implementation of a JAX-RS extension interface. Providers extend the capabilities of a JAX-RS runtime and are described in chapter 4.",
	"P1L46" : "1.6 Expert Group Members",
	"P1L47" : "This specification is being developed as part of JSR 311 under the Java Community Process. This specification is the result of the collaborative work of the members of the JSR 311 Expert Group. The following are the present and former expert group members:",
	"P1L48" : "Jan Algermissen (Individual Member)",
	"P1L49" : "Heiko Braun (Red Hat Middleware LLC)",
	"P1L50" : "Bill Burke (Red Hat Middleware LLC)",
	"P1L51" : "Larry Cable (BEA Systems)",
	"P1L52" : "Bill De Hora (Individual Member)",
	"P1L53" : "Roy Fielding (Day Software, Inc.)",
	"P1L54" : "Harpreet Geekee (Nortel)",
	"P1L55" : "Nickolas Grabovas (Individual Member)",
	"P1L56" : "Mark Hansen (Individual Member)",
	"P1L57" : "John Harby (Individual Member)",
	"P1L58" : "Hao He (Individual Member)",
	"P1L59" : "Ryan Heaton (Individual Member)",
	"P1L60" : "David Hensley (Individual Member)",
	"P1L61" : "Stephan Koops (Individual Member)",
	"P1L62" : "Changshin Lee (NCsoft Corporation)",
	"P1L63" : "Francois Leygues (Alcatel-Lucent)",
	"P1L64" : "Jerome Louvel (Individual Member)",
	"P1L65" : "Hamid Ben Malek (Fujitsu Limited)",
	"P1L66" : "Ryan J. McDonough (Individual Member)",
	"P1L67" : "Felix Meschberger (Day Software, Inc.)",
	"P1L68" : "David Orchard (BEA Systems)",
	"P1L69" : "Dhanji R. Prasanna (Individual Member)",
	"P1L70" : "Julian Reschke (Individual Member)",
	"P1L71" : "Jan Schulz-Hofen (Individual Member)",
	"P1L72" : "Joel Smith (IBM)",
	"P1L73" : "Stefan Tilkov (innoQ Deutschland GmbH)",
	"P1L74" : "1.7 Agradecimentos",
	"P1L75" : "During the course of the JSR we received many excellent suggestions on the JSR and Jersey (RI) mailing lists, thanks in particular to James Manger (Telstra) and Reto Bachmann-Gmur (Trialox) for their contributions.",
	"P1L76" : "The GenericEntity class was inspired by the Google Guice TypeLiteral class. Our thanks to Bob Lee and Google for donating this class to JAX-RS. ",
	"P1L77" : "The following individuals (all Sun Microsystems) have also made invaluable technical contributions: Roberto Chinnici, Dianne Jiao (TCK), Ron Monzillo, Rajiv Mordani, Eduardo Pelegri-Llopart, Jakub Podlesak (RI) and Bill Shannon.",

	"P2L1" : "Capítulo 2",
	"P2L2" : "Aplicações",
	"P2L3" : "A JAX-RS application consists of one or more resources (see chapter 3) and zero or more providers (see chapter 4). This chapter describes aspects of JAX-RS that apply to an application as a whole, subsequent chapters describe particular aspects of a JAX-RS application and requirements on JAX-RS implementations.",
	"P2L4" : "2.1 Configuração",
	"P2L5" : "The resources and providers that make up a JAX-RS application are configured via an application-supplied subclass of Application. An implementation MAY provide alternate mechanisms for locating resource classes and providers (e.g. runtime class scanning) but use of Application is the only portable means of configuration.",
	"P2L6" : "2.2 Validação",
	"P2L7" : "Specific validation requirements are detailed throughout this specification and the JAX-RS Javadocs. Implementations MAY perform additional validation where feasible and SHOULD report any issues arising from such validation to the user. ",
	"P2L8" : "2.3 Publicação",
	"P2L9" : "Applications are published in different ways depending on whether the application is run in a Java SE environment or within a container. This section describes the alternate means of publication.",
	"P2L10" : "2.3.1 Java SE",
	"P2L11" : "In a Java SE environment a configured instance of an endpoint class can be obtained using the create-Endpoint method of RuntimeDelegate. The application supplies an instance of Application and the type of endpoint required. An implementation MAY support zero or more endpoint types of any desired type.",
	"P2L12" : "How the resulting endpoint class instance is used to publish the application is outside the scope of this specification. ",
	"P2L13" : "2.3.1.1 JAX-WS",
	"P2L14" : "An implementation that supports publication via JAX-WS MUST support createEndpoint with an end-point type of javax.xml.ws.Provider. JAX-WS describes how a Provider based endpoint can be published in an SE environment.",
	"P2L15" : "2.3.2 Servlet",
	"P2L16" : "A JAX-RS application is packaged as a Servlet in a .war file. The Application subclass (see section 2.1), resource classes, and providers are packaged in WEB-INF/classes, required libraries are packaged in WEB-INF/lib. Included libraries MAY also contain resource classes and providers as desired. See the Servlet specification for full details on packaging of web applications. ",
	"P2L17" : "When using a JAX-RS aware servlet container, the servlet-class element of the web.xml descriptor SHOULD name the application-supplied subclass of Application.",
	"P2L18" : "When using a non-JAX-RS aware servlet container, the servlet-class element of the web.xml descriptor SHOULD name the JAX-RS implementation-supplied Servlet class. The application-supplied subclass of Application is identified using an init-param with a param-name of javax.ws.rs.Application.",
	"P2L19" : "2.3.3 Other Container",
	"P2L20" : "An implementation MAY provide facilities to host a JAX-RS application in other types of container, such facilities are outside the scope of this specification. ",

	"PaaL1" : "Appendix A",
	"PaaL2" : "Summary of Annotations",
	"PaaT1L1" : "Annotation",
	"PaaT1L2" : "Target",
	"PaaT1L3" : "Description",
	"PaaT1L4" : "Consumes",
	"PaaT1L5" : "Type or method",
	"PaaT1L6" : "Specifies a list of media types that can be consumed.",
	"PaaT1L7" : "Produces",
	"PaaT1L8" : "Type or method",
	"PaaT1L9" : "Specifies a list of media types that can be produced.",
	"PaaT1L10" : "GET",
	"PaaT1L11" : "Method",
	"PaaT1L12" : "Specifies that the annotated method handles HTTP GET requests.",
	"PaaT1L13" : "POST",
	"PaaT1L14" : "Method",
	"PaaT1L15" : "Specifies that the annotated method handles HTTP POST requests.",
	"PaaT1L16" : "PUT",
	"PaaT1L17" : "Method",
	"PaaT1L18" : "Specifies that the annotated method handles HTTP PUT requests.",
	"PaaT1L19" : "DELETE",
	"PaaT1L20" : "Method",
	"PaaT1L21" : "Specifies that the annotated method handles HTTP DELETE requests.",
	"PaaT1L22" : "HEAD",
	"PaaT1L23" : "Method",
	"PaaT1L24" : "Specifies that the annotated method handles HTTP HEAD requests. Note that HEAD may be automatically handled, see section 3.3.5.",
	"PaaT1L25" : "Path",
	"PaaT1L26" : "Type or method",
	"PaaT1L27" : "Specifies a relative path for a resource. When used on a class this annotation identifies that class as a root resource. When used on a method this annotation identifies a sub-resource method or locator.",
	"PaaT1L28" : "PathParam",
	"PaaT1L29" : "Parameter, field or method",
	"PaaT1L30" : "Specifies that the value of a method parameter, class field, or bean property is to be extracted from the request URI path. The value of the annotation identifies the name of a URI template parameter.",
	"PaaT1L31" : "QueryParam",
	"PaaT1L32" : "Parameter, field or method",
	"PaaT1L33" : "Specifies that the value of a method parameter, class field, or bean property is to be extracted from a URI query parameter. The value of the annotation identifies the name of a query parameter.",
	"PaaT1L34" : "FormParam",
	"PaaT1L35" : "Parameter, field or method",
	"PaaT1L36" : "Specifies that the value of a method parameter is to be extracted from a form parameter in a request entity body. The value of the annotation identifies the name of a form parameter. Note that whilst the annotation target allows use on fields and methods, the specification only requires support for use on resource method parameters.",
	"PaaT1L37" : "MatrixParam",
	"PaaT1L38" : "Parameter, field or method",
	"PaaT1L39" : "Specifies that the value of a method parameter, class field, or bean property is to be extracted from a URI matrix parameter. The value of the annotation identifies the name of a matrix parameter.",
	"PaaT1L40" : "CookieParam",
	"PaaT1L41" : "Parameter, field or method",
	"PaaT1L42" : "Specifies that the value of a method parameter, class field, or bean property is to be extracted from a HTTP cookie. The value of the annotation identifies the name of a the cookie.",
	"PaaT1L43" : "HeaderParam",
	"PaaT1L44" : "Parameter, field or method",
	"PaaT1L45" : "Specifies that the value of a method parameter, class field, or bean property is to be extracted from a HTTP header. The value of the annotation identifies the name of a HTTP header",
	"PaaT1L46" : "Encoded",
	"PaaT1L47" : "Type, constructor, method, field or parameter",
	"PaaT1L48" : "Disables automatic URI decoding for path, query, form and matrix parameters.",
	"PaaT1L49" : "DefaultValue",
	"PaaT1L50" : "Parameter, field or method",
	"PaaT1L51" : "Specifies a default value for a field, property or method parameter annotated with @QueryParam, @MatrixParam, @CookieParam, @FormParam or @HeaderParam. The specified value will be used if the corresponding query or matrix parameter is not present in the request URI, if the corresponding form parameter is not in the request entity body, or if the corresponding HTTP header is not included in the request.",
	"PaaT1L52" : "Context",
	"PaaT1L53" : "Field, method or parameter",
	"PaaT1L54" : "Identifies an injection target for one of the types listed in section 5.2 or the applicable section of chapter 6.",
	"PaaT1L55" : "HttpMethod",
	"PaaT1L56" : "Annotation",
	"PaaT1L57" : "Specifies the HTTP method for a request method designator annotation.",
	"PaaT1L58" : "Provider",
	"PaaT1L59" : "Type",
	"PaaT1L60" : "Specifies that the annotated class implements a JAX-RS extension interface.",

	"PabL1" : "Appendix B",
	"PabL2" : "HTTP Header Support",
	"PabL3" : "The following table lists HTTP headers that are directly supported, either automatically by a JAX-RS implementation runtime or by an application using the JAX-RS API. Any request header may be obtained using HttpHeaders, see section 5.2.2; response headers not listed here may set using the ResponseBuilder.header method.",
	"PabT1L1" : "Header",
	"PabT1L2" : "Description",
	"PabT1L3" : "Accept",
	"PabT1L4" : "Used by runtime when selecting a resource method, compared to value of @Produces annotation, see section 3.5.",
	"PabT1L5" : "Accept-Charset",
	"PabT1L6" : "Processed by runtime if application uses Request.selectVariant method, see section 5.2.3.",
	"PabT1L7" : "Accept-Encoding",
	"PabT1L8" : "Processed by runtime if application uses Request.selectVariant method, see section 5.2.3.",
	"PabT1L9" : "Accept-Language",
	"PabT1L10" : "Processed by runtime if application uses Request.selectVariant method, see section 5.2.3.",
	"PabT1L11" : "Allow",
	"PabT1L12" : "Included in automatically generated 405 error responses (see section 3.7.2) and automatically generated responses to OPTIONS requests (see section 3.3.5).",
	"PabT1L13" : "Authorization",
	"PabT1L14" : "Depends on container, information available via SecurityContext, see section 5.2.4.",
	"PabT1L15" : "Cache-Control",
	"PabT1L16" : "See CacheControl class and ResponseBuilder.cacheControl method.",
	"PabT1L17" : "Content-Encoding",
	"PabT1L18" : "Response header set by application using Response.ok or ResponseBuilder.variant.",
	"PabT1L19" : "Content-Language",
	"PabT1L20" : "Response header set by application using Response.ok, ResponseBuilder.language, or ResponseBuilder.variant.",
	"PabT1L21" : "Content-Length",
	"PabT1L22" : "Processed automatically for requests, set automatically in responses if value is provided by the MessageBodyWriter used to serialize the response entity",
	"PabT1L23" : "Content-Type",
	"PabT1L24" : "Request header used by runtime when selecting a resource method, compared to value of @Consumes annotation, see section 3.5. Response header either set by application using Response.ok, ResponseBuilder.type, or ResponseBuilder.variant, or set automatically by runtime (see section 3.8).",
	"PabT1L25" : "Cookie",
	"PabT1L26" : "See Cookie class and HttpHeaders.getCookies method.",
	"PabT1L27" : "Date",
	"PabT1L28" : "Included in responses automatically as per HTTP/1.1.",
	"PabT1L29" : "ETag",
	"PabT1L30" : "See EntityTag class, Response.notModified method and ResponseBuilder.tag method.",
	"PabT1L31" : "Expect",
	"PabT1L32" : "Depends on underlying container.",
	"PabT1L33" : "Expires",
	"PabT1L34" : "Set by application using the ResponseBuilder.expires method.",
	"PabT1L35" : "If-Match",
	"PabT1L36" : "Processed by runtime if application uses corresponding Request.evaluatePreconditions method, see section 5.2.3.",
	"PabT1L37" : "If-Modified-Since",
	"PabT1L38" : "Processed by runtime if application uses corresponding Request.evaluatePreconditions method, see section 5.2.3.",
	"PabT1L39" : "If-None-Match",
	"PabT1L40" : "Processed by runtime if application uses corresponding Request.evaluatePreconditions method, see section 5.2.3.",
	"PabT1L41" : "If-Unmodified-Since",
	"PabT1L42" : "Processed by runtime if application uses corresponding Request.evaluatePreconditions method, see section 5.2.3.",
	"PabT1L43" : "Last-Modified",
	"PabT1L44" : "Set by application using the ResponseBuilder.lastModified method.",
	"PabT1L45" : "Location",
	"PabT1L46" : "Set by application using the applicable Response method or directly using the ResponseBuilder.location method.",
	"PabT1L47" : "Set-Cookie",
	"PabT1L48" : "See NewCookie class and ResponseBuilder.cookie method.",
	"PabT1L49" : "Transfer-Encoding",
	"PabT1L50" : "See section 4.2.5.",
	"PabT1L51" : "Vary",
	"PabT1L52" : "Set by application using Response.notAcceptable method or ResponseBuilder.variants method.",
	"PabT1L53" : "WWW-Authenticate",
	"PabT1L54" : "Depends on container",

	"PacL1" : "Appendix C",
	"PacL2" : "Change Log",
	"PacL3" : "C.1 Changes Since Proposed Final Draft",
	"PacL4" : "Section 3.7.2: Additional sort criteria so that templates with explicit regexs are sorted ahead of those with the default",
	"PacL5" : "Sections 3.7.2, 3.8, 4.2.3 and 4.3.1: Q-values not used in @Consumes or @Produces.",
	"PacL6" : "Section 4.2.2: Fixed algorithm to refer to section 3.8 instead of restating it. Fixed status code returned when the media type has been determined but an appropriate message body writer cannot be located.",
	"PacL7" : "Chapter 7: Clarify that an implementation can supply an alternate RuntimeDelegate API class.",
	"PacL8" : "C.2 Changes Since Public Review Draft",
	"PacL9" : "Chapter 2: Renamed ApplicationConfig class to Application.",
	"PacL10" : "Chapter 3: UriBuilder reworked to always encode components.",
	"PacL11" : "Sections 3.1.2 and 4.1.1: Added requirement to warn when choice of constructor is ambiguous.",
	"PacL12" : "Section 3.2: FormParam no longer required to be supported on fields or properties.",
	"PacL13" : "Section 3.3.3: Added text describing how to determine raw and generic types from method return type and returned instance. ",
	"PacL14" : "Section 3.4: Template parameters can specify the regular expression that forms their capturing group.",
	"PacL15" : "Section 3.7.1: Make pre-processed URIs available rather than original request URI. Added URI normalization.",
	"PacL16" : "Section 3.7.1: Removed URI-based content negotiation.",
	"PacL17" : "Section 3.7.2: Reorganized the request matching algorithm to remove redundancy and improve readability, no functional change.",
	"PacL18" : "Section 3.7.3: Changes to regular expressions to eliminate edge cases.",
	"PacL19" : "Section 4.2: Added requirement to use JavaBean Activation Framework when no entity provider can be found.",
	"PacL20" : "Section 4.2.4: Require standard JAXB entity providers to use application-supplied JAXB contexts in preference to their own. ",
	"PacL21" : "Section 4.3: Added support for specifying media type capabilities of context providers.",
	"PacL22" : "Section 5.2: Removed ContextResolver from list of injectable resources.",
	"PacL23" : "Section 5.2.5: Changed name to Providers, removed entity provider-specific text to reflect more generic capabilities. ",
	"PacL24" : "Chapter B: New appendix describing where particular HTTP headers are supported.",

	"PbL1" : "Bibliography",
	"PbL2" : "[1] R. Fielding. Architectural Styles and the Design of Network-based Software Architectures. Ph.d dissertation, University of California, Irvine, 2000. See http://roy.gbiv.com/pubs/dissertation/top.htm.",
	"PbL3" : "[2] REST Wiki. Web site. See http://rest.blueoxen.net/cgi-bin/wiki.pl.",
	"PbL4" : "[3] Representational State Transfer. Web site, Wikipedia. See http://en.wikipedia.org/wiki/Representational State Transfer",
	"PbL5" : "[4] R. Fielding, J. Gettys, J. C. Mogul, H. Frystyk, and T. Berners-Lee. RFC 2616: Hypertext Transfer Protocol – HTTP/1.1. RFC, IETF, January 1997. See http://www.ietf.org/rfc/rfc2616.txt.",
	"PbL6" : "[5] T. Berners-Lee, R. Fielding, and L. Masinter. RFC 3986: Uniform Resource Identifier (URI): Generic Syntax. RFC, IETF, January 2005. See http://www.ietf.org/rfc/rfc3986.txt. ",
	"PbL7" : "[6] L. Dusseault. RFC 4918: HTTP Extensions for Web Distributed Authoring and Versioning (WebDAV). RFC, IETF, June 2007. See http://www.ietf.org/rfc/rfc4918.txt. ",
	"PbL8" : "[7] J.C. Gregorio and B. de hOra. The Atom Publishing Protocol. Internet Draft, IETF, March 2007. See http://bitworking.org/projects/atom/draft-ietf-atompub-protocol-14.html. ",
	"PbL9" : "[8] G. Murray. Java Servlet Specification Version 2.5. JSR, JCP, October 2006. See http://java.sun.com/products/servlet.",
	"PbL10" : "[9] R. Chinnici, M. Hadley, and R. Mordani. Java API for XML Web Services. JSR, JCP, August 2005. See http://jcp.org/en/jsr/detail?id=224. ",
	"PbL11" : "[10] S. Bradner. RFC 2119: Keywords for use in RFCs to Indicate Requirement Levels. RFC, IETF, March 1997. See http://www.ietf.org/rfc/rfc2119.txt. ",
	"PbL12" : "[11] Bill Shannon. JavaBeans Activation Framework. JSR, JCP, May 2006. See http://jcp.org/en/jsr/detail?id=925. "
}
